app/controllers/api/decks_controller.rb

    def index
        @decks = Deck.all
---
SELECT "decks".* FROM "decks"

    def create
        @deck = Deck.new(deck_params)

        if @deck.save
---
INSERT INTO "decks" ("creator_id", "title", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["creator_id", 16], ["title", "yoohoo"], ["created_at", "2020-11-17 02:44:36.784803"], ["updated_at", "2020-11-17 02:44:36.784803"]]

    def show
        @deck = Deck.find_by(id: params[:id])
---
SELECT  "decks".* FROM "decks" WHERE "decks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]